{
  "locations": [
    {
      "id": 1,
      "name": "Bahen 1F",
      "brief_description": "You are on the first floor of the Bahen Center. There are elevators to the West, and an exit from the building to St. George street to the East.",
      "long_description": "You are on the first floor of the Bahen Center. It's usually crowded at this time of the day, but today it's eerily quiet. Only a few students are studying at the table near the doors. You better not disturb them. One student is rushing down the corridor, wearing a heavy-looking backpack and carrying a textbook in their arms. There are elevators to the West, and an exit from the building to St. George street to the East.",
      "inspect_text": "You see something shiny on the ground -- looks like a toonie?",
      "available_commands": {
        "go north": 2
      },
      "items": ["toonie"]
    },
    {
      "id": 2,
      "name": "McLennan Physical Laboratories 3F",
      "brief_description": "You are on the third floor of McLennan Physical Laboratories. There are lecture rooms down the hall. You've spent a lot of time here agonizing over MAT137 - but you enjoy the course.",
      "long_description": "You are on the third floor of McLennan Physical Laboratories. The hallway is lined with lecture rooms, and students are huddled around, waiting for their next lecture. As you walk down the hall, you notice a few students rushing to class, while others are quietly studying in the undergraduate drop-in center. There's a staircase leading downstairs and a hallway to the adjacent building",
      "inspect_text": "You spot an abandoned textbook on one of the tables. It looks like it's been there for hours.",
      "available_commands": {
        "go north": 5,
        "go east": 3,
        "go south": 1
      },
      "items": ["abandoned textbook"]
    },
    {
      "id": 3,
      "name": "Kings College Circle",
      "brief_description": "You are standing in the middle of Kings College Circle, a beautiful open space surrounded by some of the oldest buildings on campus.",
      "long_description": "You are in the heart of the University of Toronto campus, surrounded by lush greenery (in spring) and historic stone buildings. The towering spires of the University College and the distinctive brick architecture of the King's College buildings frame the circle. Students walk by in every direction, some carrying coffee cups, others chatting with friends or absorbed in their phones. You can see a few benches scattered around, but no one sits there in this cold. To the south, the path leads toward St. George Street, while the west side opens up toward the Temerty Faculty of Medicine.",
      "inspect_text": "You notice a laptop charger lying by a bench. Someone must have left it behind in a hurry, worrying about their upcoming assignment.",
      "available_commands": {
        "go north": 6,
        "go east": 4,
        "go west": 2
      },
      "items": ["laptop charger"]
    },
    {
      "id": 4,
      "name": "Medical Science Building",
      "brief_description": "You are in the Medical Science Building, a place filled with the hustle of students and the faint smell of coffee.",
      "long_description": "The Medical Science Building is always bustling with activity. Inside, the bright white walls and windows brighten the lobby, where a few students sit, waiting for a test or lecture. Furhter inside is the food court, where some students are grabbing lunch, and past that are the false gardens. You like to exit the building from here and look at the scenery as you pass.",
      "inspect_text": "There's a set of research papers scattered on the table, possibly left behind by a student in a rush.",
      "available_commands": {
        "go north": 7,
        "go west": 3
      },
      "items": []
    },
    {
      "id": 5,
      "name": "Robarts Library",
      "brief_description": "You are inside Robarts Library, a massive building with towering shelves of books and the hum of quiet studying all around.",
      "long_description": "The Robarts Library is a sanctuary for students looking for a quiet place to study. The shelves are filled with academic texts and research journals, and the air is filled with the quiet rustling of pages being turned. The library's distinctive Brutalist architecture is imposing, with stark concrete walls and high ceilings. You can see students scattered around the various floors, some reading in silence, others typing away on laptops. The library's layout is a maze of staircases, study rooms, and reading areas. There's a small snack station on the first floor where students grab quick bites between study sessions.",
      "inspect_text": "A lone UofT mug sits abandoned on a table near the stairwell, as if someone was interrupted in the middle of their study session.",
      "available_commands": {
        "go north": 9,
        "go east": 6,
        "go south": 2
      },
      "items": ["lucky uoft mug"]
    },
    {
      "id": 6,
      "name": "Trinity College",
      "brief_description": "You are at Trinity College, an area of the campus known for its historic buildings and beautiful grounds.",
      "long_description": "Trinity College is one of the oldest and most prestigious colleges on campus. The grounds are beautifully landscaped, with paths winding through manicured gardens. The college’s architecture is a mix of Gothic and modern styles, with ivy creeping up the stone walls. Students gather in small groups around the quad, some discussing their latest assignments, while others enjoy the serene atmosphere. The central courtyard is perfect for a peaceful walk, and the nearby chapel offers a quiet place for reflection. The library here is known for its rare collections, and students often visit to study in its peaceful rooms.",
      "inspect_text": "You notice a small sculpture in the corner of the courtyard, perhaps a hidden gem that not many people notice.",
      "available_commands": {
        "go north": 10,
        "go east": 7,
        "go south": 3,
        "go west": 5
      },
      "items": []
    },
    {
      "id": 7,
      "name": "Queens Park",
      "brief_description": "You are standing in Queens Park, a large park area near the downtown core of the city.",
      "long_description": "Queens Park is a peaceful green space surrounded by the tall buildings of downtown Toronto. The park is a popular spot for students to relax between classes, and there are always a few joggers or cyclists passing by. The sound of birds chirping and the rustling of trees in the breeze offer a welcome break from the urban noise. In the distance, you can see the Ontario Legislative Building, its majestic columns looming above the park. The pathways are lined with benches, perfect for resting, and there are a few vendors offering snacks on the northern edge of the park.",
      "inspect_text": "A lone rock lies to the side. It may not seem useful to other passerbys, but you see potential.",
      "available_commands": {
        "go north": 11,
        "go east": 8,
        "go south": 4,
        "go west": 6
      },
      "items": ["large rock"]
    },
    {
      "id": 8,
      "name": "Dorm Room (Elmsley Hall, SMC)",
      "brief_description": "You are inside your dorm room. The bed is unmade, and textbooks are scattered around the room.",
      "long_description": "The room feels lived in, with artwork on the walls and figurines on the headboard. A half-eaten sandwich sits on the desk beside an open laptop, while textbooks and lecture notes are strewn across the bed. The window overlooks the campus, offering a great view of the surrounding buildings. You can hear the sounds of students chatting and walking by in the hallway outside. The room feels like a temporary sanctuary from the chaos of campus life, offering a brief escape for its inhabitant. The bed is a little too small for comfort, but it will do for now.",
      "inspect_text": "There’s an old cup of noodles on the desk. It’s probably been there for days, but it’s hard to tell with the mess around.",
      "available_commands": {
        "go west": 7
      },
      "items": []
    },
    {
      "id": 9,
      "name": "St. George Station",
      "brief_description": "You are at St. George Station, a bustling subway station located near the heart of Toronto's campus.",
      "long_description": "St. George Station is one of the busiest subway stations in Toronto, with thousand of passengers passing through daily. The constant hum of train announcements fills the air, and the crowds ebb and flow as commuters enter and exit. There's a map of the subway system on a nearby pillar, and a few benches scattered around the station where tired commuters take a moment to rest. The station connects students to various parts of the city, with trains frequently (or not so frequently) arriving and departing.",
      "inspect_text": "You see a subway sign thats fallen off the station... a neat find. It could spruce up someones living space",
      "available_commands": {
        "go east": 10,
        "go south": 5
      },
      "items": ["line 1 sign"]
    },
    {
      "id": 10,
      "name": "Varsity Center",
      "brief_description": "You are at the Varsity Center, a large sports complex and athletic hub for students.",
      "long_description": "The Varsity Center is a massive sports complex located at the heart of the university. It includes a gym, a swimming pool, a track, and multiple indoor courts. Students often come here to unwind after a long day of lectures, or to get in some exercise between study sessions. The walls are adorned with banners celebrating the achievements of various university sports teams. There’s a café on the ground floor where you can grab a quick smoothie or snack before heading back to your next class.",
      "inspect_text": "The varsity center is always neat, to avoid tripping hazards. Not much else to see here.",
      "available_commands": {
        "go east": 11,
        "go south": 6,
        "go west": 9
      },
      "items": []
    },
    {
      "id": 11,
      "name": "Royal Ontario Museum",
      "brief_description": "You are outside the Royal Ontario Museum, a cultural landmark filled with artifacts from around the world.",
      "long_description": "The Royal Ontario Museum is a treasure trove of history and culture. The halls are filled with exhibits showcasing everything from ancient artifacts to fossils to precious stones. The museum's distinctive look blends old-world charm with modern glass and steel, offering a striking contrast. The atmosphere is quiet, as visitors wander through the various galleries, taking in the exhibits. The museum is an oasis of knowledge and beauty in the heart of the city (though, in your opinion, the AGO is the far superior choice).",
      "inspect_text": "You see a USB drive on one of the display cases. It must have been left there by a careless visitor, who was rushing around finding exhibits for their Art History assignment.",
      "available_commands": {
        "go south": 7,
        "go west": 10
      },
      "items": ["usb drive"]
    }
  ],
  "items": [
    {
      "name": "toonie",
      "description": "There is a toonie on the ground. Someone must have dropped it.",
      "start_position": 1,
      "target_position": 11,
      "target_points": 1,
      "weight": 1.0
    },
    {
      "name": "abandoned textbook",
      "description": "There's a textbook on the table. Someone must have forgotten it.",
      "start_position": 2,
      "target_position": 11,
      "target_points": 2,
      "weight": 3.0
    },
    {
      "name": "large rock",
      "description": "It's a rock. ... It compels you.",
      "start_position": 7,
      "target_position": 11,
      "target_points": 3,
      "weight": 5.5
    },
    {
      "name": "usb drive",
      "description": "Your USB drive. It contains the only copy of your game, you goofball.",
      "start_position": 11,
      "target_position": 8,
      "target_points": 5,
      "weight": 0.5
    },
    {
      "name": "laptop charger",
      "description": "A laptop charger. Someone could charge their near-dead laptop and submit their CSC111 project with it.",
      "start_position": 3,
      "target_position": 8,
      "target_points": 5,
      "weight": 2.5
    },
    {
      "name": "lucky uoft mug",
      "description": "A lone UofT mug. It looks well-loved, like it's accompanied someone through their failures and triumphs alike. There must be a strong bond between this mug and its owner.",
      "start_position": 5,
      "target_position": 8,
      "target_points": 5,
      "weight": 2.0
    },
    {
      "name": "line 1 sign",
      "description": "A sign for Line 1 of the TTC. It had laid on the floor of the St. George station, somehow unnoticed by any passerbys.",
      "start_position": 9,
      "target_position": 11,
      "target_points": 5,
      "weight": 6.0
    }
  ]
}
